API - Copy/APITest2/Log/vtd_user.log

2023-01-10 22:49:02,421 [1] INFO  - Loaded appender: FileAppenderExternal
2023-01-10 22:49:02,426 [1] INFO  - Loaded appender: UserLoggerAppender
2023-01-10 22:49:02,427 [1] INFO  - Loaded appender: FileAppenderInternal
2023-01-10 22:49:02,427 [1] INFO  - Loaded appender: FileAppenderExternal
2023-01-10 22:49:02,428 [1] INFO  - Loaded appender: UserLoggerAppender
2023-01-10 22:49:02,428 [1] INFO  - Loaded appender: FileAppenderInternal
2023-01-10 22:49:02,622 [17] INFO  - Step 'Start' : Step 'Start' started
2023-01-10 22:49:02,649 [17] INFO  - Step 'Start' ended successfully
2023-01-10 22:49:02,650 [17] INFO  - Step 'Test Flow' : Step 'Test Flow' started
2023-01-10 22:49:02,652 [17] INFO  - Step 'Iteration 1' : Step 'Iteration 1' started
2023-01-10 22:49:02,654 [17] INFO  - Step 'GetFlights' : Step 'GetFlights' started
2023-01-10 22:49:02,663 [17] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <GetFlights xmlns="HP.SOAQ.SampleApp">
      <DepartureCity>Denver</DepartureCity>
      <ArrivalCity>Portland</ArrivalCity>
      <FlightDate>2024-01-01T00:00:00+00:00</FlightDate>
    </GetFlights>
  </Body>
</Envelope>

2023-01-10 22:49:02,674 [17] INFO  - URL: http://localhost:8000/Flights_SOAP
2023-01-10 22:49:02,691 [17] INFO  - Returning the response to the previous channel
2023-01-10 22:49:02,695 [17] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <GetFlightsResponse xmlns="HP.SOAQ.SampleApp">
      <GetFlightsResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <Flight>
          <Airline>UA</Airline>
          <ArrivalCity>Portland</ArrivalCity>
          <ArrivalTime>12:04 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:23 AM</DepartureTime>
          <FlightNumber>1411</FlightNumber>
          <Price>136.2</Price>
        </Flight>
        <Flight>
          <Airline>UA</Airline>
          <ArrivalCity>Portland</ArrivalCity>
          <ArrivalTime>03:40 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>01:59 PM</DepartureTime>
          <FlightNumber>2435</FlightNumber>
          <Price>161.4</Price>
        </Flight>
        <Flight>
          <Airline>UA</Airline>
          <ArrivalCity>Portland</ArrivalCity>
          <ArrivalTime>09:40 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>07:59 AM</DepartureTime>
          <FlightNumber>2487</FlightNumber>
          <Price>153.8</Price>
        </Flight>
        <Flight>
          <Airline>UA</Airline>
          <ArrivalCity>Portland</ArrivalCity>
          <ArrivalTime>08:28 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>06:47 PM</DepartureTime>
          <FlightNumber>2777</FlightNumber>
          <Price>137.8</Price>
        </Flight>
        <Flight>
          <Airline>UA</Airline>
          <ArrivalCity>Portland</ArrivalCity>
          <ArrivalTime>07:16 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>05:35 PM</DepartureTime>
          <FlightNumber>2956</FlightNumber>
          <Price>127</Price>
        </Flight>
        <Flight>
          <Airline>UA</Airline>
          <ArrivalCity>Portland</ArrivalCity>
          <ArrivalTime>06:04 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>04:23 PM</DepartureTime>
          <FlightNumber>2980</FlightNumber>
          <Price>131</Price>
        </Flight>
        <Flight>
          <Airline>UA</Airline>
          <ArrivalCity>Portland</ArrivalCity>
          <ArrivalTime>01:16 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>11:35 AM</DepartureTime>
          <FlightNumber>3815</FlightNumber>
          <Price>138.6</Price>
        </Flight>
        <Flight>
          <Airline>UA</Airline>
          <ArrivalCity>Portland</ArrivalCity>
          <ArrivalTime>10:52 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>09:11 AM</DepartureTime>
          <FlightNumber>4384</FlightNumber>
          <Price>129.8</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Portland</ArrivalCity>
          <ArrivalTime>11:00 AM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>08:00 AM</DepartureTime>
          <FlightNumber>6290</FlightNumber>
          <Price>178.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Portland</ArrivalCity>
          <ArrivalTime>01:24 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>10:24 AM</DepartureTime>
          <FlightNumber>6294</FlightNumber>
          <Price>171.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Portland</ArrivalCity>
          <ArrivalTime>03:48 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:48 PM</DepartureTime>
          <FlightNumber>6298</FlightNumber>
          <Price>174.47</Price>
        </Flight>
        <Flight>
          <Airline>AA</Airline>
          <ArrivalCity>Portland</ArrivalCity>
          <ArrivalTime>06:12 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:12 PM</DepartureTime>
          <FlightNumber>6302</FlightNumber>
          <Price>177.47</Price>
        </Flight>
        <Flight>
          <Airline>UA</Airline>
          <ArrivalCity>Portland</ArrivalCity>
          <ArrivalTime>04:52 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>03:11 PM</DepartureTime>
          <FlightNumber>9411</FlightNumber>
          <Price>126.6</Price>
        </Flight>
        <Flight>
          <Airline>UA</Airline>
          <ArrivalCity>Portland</ArrivalCity>
          <ArrivalTime>02:28 PM</ArrivalTime>
          <DepartureCity>Denver</DepartureCity>
          <DepartureTime>12:47 PM</DepartureTime>
          <FlightNumber>9522</FlightNumber>
          <Price>132.2</Price>
        </Flight>
      </GetFlightsResult>
    </GetFlightsResponse>
  </s:Body>
</s:Envelope>

2023-01-10 22:49:02,706 [17] INFO  - Structural Validation: True
2023-01-10 22:49:02,711 [17] INFO  - Step 'GetFlights' ended successfully
2023-01-10 22:49:02,712 [17] INFO  - Step 'CreateFlightOrder' : Step 'CreateFlightOrder' started
2023-01-10 22:49:02,714 [17] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/" xmlns:p1="http://www.w3.org/2001/XMLSchema-instance">
  <Body>
    <CreateFlightOrder xmlns="HP.SOAQ.SampleApp">
      <FlightOrder>
        <Class>First</Class>
        <CustomerName>Howard Jessee</CustomerName>
        <DepartureDate>2024-01-01T00:00:00+00:00</DepartureDate>
        <FlightNumber>1411</FlightNumber>
        <NumberOfTickets>1</NumberOfTickets>
      </FlightOrder>
    </CreateFlightOrder>
  </Body>
</Envelope>

2023-01-10 22:49:02,716 [17] INFO  - URL: http://localhost:8000/Flights_SOAP
2023-01-10 22:49:02,720 [17] INFO  - Returning the response to the previous channel
2023-01-10 22:49:02,721 [17] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <CreateFlightOrderResponse xmlns="HP.SOAQ.SampleApp">
      <CreateFlightOrderResult xmlns:i="http://www.w3.org/2001/XMLSchema-instance">
        <OrderNumber>109</OrderNumber>
        <TotalPrice>136.2</TotalPrice>
      </CreateFlightOrderResult>
    </CreateFlightOrderResponse>
  </s:Body>
</s:Envelope>

2023-01-10 22:49:02,728 [17] INFO  - Structural Validation: True
2023-01-10 22:49:02,730 [17] INFO  - Step 'CreateFlightOrder' ended successfully
2023-01-10 22:49:02,731 [17] INFO  - Step 'DeleteAllFlightOrders' : Step 'DeleteAllFlightOrders' started
2023-01-10 22:49:02,732 [17] INFO  - 
Request:

<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
  <Body>
    <DeleteAllFlightOrders xmlns="HP.SOAQ.SampleApp" />
  </Body>
</Envelope>

2023-01-10 22:49:02,733 [17] INFO  - URL: http://localhost:8000/Flights_SOAP
2023-01-10 22:49:02,737 [17] INFO  - Returning the response to the previous channel
2023-01-10 22:49:02,738 [17] INFO  - 
Response:

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
  <s:Body>
    <DeleteAllFlightOrdersResponse xmlns="HP.SOAQ.SampleApp">
      <DeleteAllFlightOrdersResult>true</DeleteAllFlightOrdersResult>
    </DeleteAllFlightOrdersResponse>
  </s:Body>
</s:Envelope>

2023-01-10 22:49:02,741 [17] INFO  - Structural Validation: True
2023-01-10 22:49:02,743 [17] INFO  - Step 'DeleteAllFlightOrders' ended successfully
2023-01-10 22:49:02,744 [17] INFO  - Step 'Iteration 1' ended successfully
2023-01-10 22:49:02,745 [17] INFO  - Step 'Test Flow' ended successfully
2023-01-10 22:49:02,746 [17] INFO  - Step 'End' : Step 'End' started
2023-01-10 22:49:02,751 [17] INFO  - Step 'End' ended successfully
